{
    "animals": [
        {
            "name": "Aardvark",
            "habitat": "Found in savannas and grasslands",
            "data": "Weighs between 110 and 180 pounds",
            "info": "Nocturnal insectivore",
            "fact": "Have a keen sense of smell",
            "description": "Known for their long snouts and powerful digging abilities."
        },
        {
            "name": "Aardwolf",
            "habitat": "Found on open grasslands",
            "data": "Mainly insectivorous",
            "info": "Solitary and nocturnal animals",
            "fact": "Hyena-like but feed on termites",
            "description": "Small, insect-eating hyenas known for their termite-rich diet."
        },
        {
            "name": "Albatross",
            "habitat": "Found on the open ocean and coastlines",
            "data": "Wingspan can reach up to 12 feet",
            "info": "Excellent long-distance fliers",
            "fact": "Can sleep while flying",
            "description": "Large seabirds renowned for their impressive wingspan and long-distance flights."
        },
        {
            "name": "Alligator",
            "habitat": "Found in freshwater environments like swamps and rivers",
            "data": "Can grow up to 13 feet in length",
            "info": "Cold-blooded reptiles with powerful jaws",
            "fact": "Have a lifespan of up to 35-50 years",
            "description": "Large reptiles known for their formidable jaws and semi-aquatic lifestyles."
        },
        {
            "name": "Alpaca",
            "habitat": "Found in the Andes Mountains of South America",
            "data": "Cousin of the llama",
            "info": "Raised for their soft and luxurious fleece",
            "fact": "Gentle and social animals",
            "description": "Domesticated camelids known for their fine fleece and friendly nature."
        },
        {
            "name": "Amphibian",
            "habitat": "Found in various aquatic and terrestrial environments",
            "data": "Can breathe through their skin",
            "info": "Undergo metamorphosis during their life cycle",
            "fact": "Bioindicators of environmental health",
            "description": "Amphibians are a diverse group of animals that live both in water and on land during their life cycle."
        },
        {
            "name": "Anaconda",
            "habitat": "Found in the Amazon rainforest and other tropical regions",
            "data": "One of the largest snake species in the world",
            "info": "Constrictor that preys on large mammals and birds",
            "fact": "Give birth to live young",
            "description": "Giant constrictor snakes known for their immense size and ambush hunting."
        },
        {
            "name": "Angelfish",
            "habitat": "Found in coral reefs of the tropical oceans",
            "data": "Come in various colorful species",
            "info": "Popular in the aquarium trade",
            "fact": "Known for their striking patterns",
            "description": "Brightly colored, tropical fish admired for their vibrant appearance."
        },
        {
            "name": "Anglerfish",
            "habitat": "Found in the deep sea",
            "data": "Females are much larger than males",
            "info": "Use a bioluminescent lure to attract prey",
            "fact": "Have a unique reproductive strategy",
            "description": "Mysterious deep-sea fish known for their bioluminescent lure and bizarre mating habits."
        },
        {
            "name": "Ant",
            "habitat": "Found in colonies underground and on the surface",
            "data": "Strong and highly organized social insects",
            "info": "Communicate using pheromones",
            "fact": "Can carry objects many times their own body weight",
            "description": "Highly organized social insects that live in colonies and work together to accomplish tasks."
        },
        {
            "name": "Anteater",
            "habitat": "Found in forests and grasslands of Central and South America",
            "data": "Specialized tongue for eating ants and termites",
            "info": "Solitary and primarily nocturnal",
            "fact": "Can consume thousands of insects in a day",
            "description": "Unique mammals with long snouts and tongues adapted for eating ants and termites."
        },
        {
            "name": "Antelope",
            "habitat": "Found in a variety of grassland and woodland habitats",
            "data": "Fast runners and agile jumpers",
            "info": "Many species exhibit sexual dimorphism",
            "fact": "Herbivorous and have a keen sense of hearing",
            "description": "Graceful herbivores known for their speed and agility in grassland ecosystems."
        },
        {
            "name": "Antlion",
            "habitat": "Found in sandy environments",
            "data": "Larvae create pitfall traps for prey",
            "info": "Adult resemble dragonflies",
            "fact": "Skilled ambush predators",
            "description": "Insect species known for their unique predatory behavior and larval pitfall traps."
        },
        {
            "name": "Ape",
            "habitat": "Found in tropical rainforests and a few other environments",
            "data": "Closest relatives to humans",
            "info": "Species include gorillas, chimpanzees, bonobos, and orangutans",
            "fact": "Have complex social structures",
            "description": "Highly intelligent primates known for their close genetic relation to humans."
        },
        {
            "name": "Aphid",
            "habitat": "Found on plants and trees",
            "data": "Small, soft-bodied insects",
            "info": "Reproduce rapidly through a process called parthenogenesis",
            "fact": "Pests to many crops and garden plants",
            "description": "Tiny insects known for their rapid reproduction and ability to damage plants."
        },
        {
            "name": "Armadillo",
            "habitat": "Found in a range of environments, from forests to grasslands",
            "data": "Protected by a bony armor-like shell",
            "info": "Good swimmers and diggers",
            "fact": "Primarily insectivorous",
            "description": "Small mammals known for their unique armored shells and adaptable habitats."
        },
        {
            "name": "Asp",
            "habitat": "Found in dry and rocky areas of Africa and the Middle East",
            "data": "Venomous snake species",
            "info": "Associated with ancient Egyptian mythology",
            "fact": "Venom contains potent neurotoxins",
            "description": "Venomous snakes known for their historical significance in ancient Egyptian culture."
        },

        {
            "name": "Baboon",
            "habitat": "Found in savannas and open woodlands",
            "data": "Omnivorous and highly social primates",
            "info": "Distinctive dog-like snouts and colorful bottoms",
            "fact": "Known for their complex social hierarchies",
            "description": "Old World monkeys known for their distinctive appearance and social behaviors."
        },
        {
            "name": "Badger",
            "habitat": "Found in a variety of habitats, including forests and grasslands",
            "data": "Burrowing mammals with powerful claws",
            "info": "Solitary and primarily nocturnal hunters",
            "fact": "Known for their digging prowess",
            "description": "Stout-bodied mammals recognized for their burrowing and hunting skills."
        },
        {
            "name": "Bandicoot",
            "habitat": "Found in forests, grasslands, and coastal areas of Australia and nearby islands",
            "data": "Marsupials with a distinctive long snout",
            "info": "Primarily insectivorous and small in size",
            "fact": "Have a pouch for carrying their young",
            "description": "Small marsupials known for their unique appearance and pouches."
        },
        {
            "name": "Barnacle",
            "habitat": "Found attached to hard surfaces in aquatic environments",
            "data": "Sessile crustaceans with a shell-like structure",
            "info": "Filter feeders that capture food particles from water",
            "fact": "Have one of the longest penises relative to body size in the animal kingdom",
            "description": "Small, stationary crustaceans that live in marine environments."
        },
        {
            "name": "Barracuda",
            "habitat": "Found in tropical and subtropical oceans worldwide",
            "data": "Fast-swimming predators with sharp teeth",
            "info": "Ambush hunters that prey on smaller fish",
            "fact": "Known for their impressive swimming speed",
            "description": "Sleek and fearsome-looking fish that inhabit warm ocean waters."
        },
        {
            "name": "Basilisk",
            "habitat": "Found in tropical rainforests of Central and South America",
            "data": "Also known as the Jesus Christ Lizard due to its ability to run on water",
            "info": "Insectivorous and highly agile reptiles",
            "fact": "Can reach speeds of up to 5 miles per hour on water",
            "description": "Small, arboreal lizards known for their unique running-on-water ability."
        },
        {
            "name": "Bass",
            "habitat": "Found in freshwater bodies like lakes, rivers, and ponds",
            "data": "Popular game fish with various species",
            "info": "Carnivorous and known for their strong fighting ability",
            "fact": "Fishing is a popular recreational activity",
            "description": "Highly sought-after freshwater fish known for their sportfishing appeal."
        },
        {
            "name": "Bat",
            "habitat": "Found in various habitats, including caves, forests, and urban areas",
            "data": "The only mammals capable of sustained flight",
            "info": "Primarily insectivorous, but some species feed on fruit or nectar",
            "fact": "Play crucial roles in pollination and insect control",
            "description": "Diverse flying mammals with adaptations for nocturnal life and echolocation."
        },
        {
            "name": "Bear",
            "habitat": "Found in a wide range of habitats, from forests to tundra",
            "data": "Large, omnivorous mammals with hibernation capabilities",
            "info": "Various species, including polar, grizzly, and black",
            "fact": "Symbolically significant in many cultures",
            "description": "Iconic mammals known for their strength, adaptability, and hibernation habits."
        },
        {
            "name": "Beaver",
            "habitat": "Found in freshwater environments with access to wood for dam building",
            "data": "Rodents known for building dams and lodges",
            "info": "Herbivorous and capable swimmers",
            "fact": "Ecosystem engineers, shaping their habitats",
            "description": "Industrious rodents known for their dam-building and water-management skills."
        },
        {
            "name": "Bedbug",
            "habitat": "Found in human dwellings, especially beds and furniture",
            "data": "Blood-feeding insects that cause skin irritation in humans",
            "info": "Nocturnal and highly resistant to pesticides",
            "fact": "Can survive for months without feeding",
            "description": "Parasitic insects that infest human living spaces and feed on blood."
        },
        {
            "name": "Bee",
            "habitat": "Found in various ecosystems, including gardens and meadows",
            "data": "Important pollinators crucial for plant reproduction",
            "info": "Social insects with a caste system (queen, workers, drones)",
            "fact": "Produce honey and beeswax",
            "description": "Essential insects known for their role in pollination and honey production."
        },
        {
            "name": "Beetle",
            "habitat": "Found in diverse terrestrial environments worldwide",
            "data": "The largest order of insects with over 350,000 species",
            "info": "Hard exoskeleton and chewing mouthparts",
            "fact": "Exhibit incredible diversity in size, shape, and behavior",
            "description": "Diverse group of insects known for their varied forms and ecological roles."
        },
        {
            "name": "Bird",
            "habitat": "Found in virtually all terrestrial and aquatic environments",
            "data": "Warm-blooded vertebrates with feathers and beaks",
            "info": "Diverse species with various adaptations for flight and terrestrial life",
            "fact": "Descendants of theropod dinosaurs",
            "description": "Highly diverse vertebrates known for their ability to fly and inhabit diverse habitats."
        },
        {
            "name": "Bison",
            "habitat": "Found in grasslands and open plains of North America",
            "data": "Large, herbivorous mammals with shaggy fur and humps",
            "info": "Social animals that once roamed in massive herds",
            "fact": "Nearly driven to extinction in the 19th century",
            "description": "Iconic American mammals known for their historical significance and size."
        },
        {
            "name": "Blackbird",
            "habitat": "Found in a variety of habitats, including woodlands and urban areas",
            "data": "Omnivorous songbirds known for their melodious calls",
            "info": "Common are known for their distinctive black plumage",
            "fact": "Celebrated in literature and folklore",
            "description": "Passerine birds admired for their songs and adaptability."
        },
        {
            "name": "Boa",
            "habitat": "Found in tropical and subtropical regions of the Americas",
            "data": "Non-venomous constrictor snakes with muscular bodies",
            "info": "Ambush predators that primarily feed on rodents and birds",
            "fact": "Some species give birth to live young",
            "description": "Constrictor snakes known for their strength and diverse species."
        },
        {
            "name": "Boar",
            "habitat": "Found in various habitats, including forests and grasslands",
            "data": "Wild swine with distinctive tusks",
            "info": "Omnivorous and often forage for food in the ground",
            "fact": "Known for their aggressive behavior when threatened",
            "description": "Wild pigs known for their adaptability and tusks."
        },
        {
            "name": "Bobcat",
            "habitat": "Found in a range of North American habitats, including forests and deserts",
            "data": "Medium-sized, solitary cats with distinctive spots and tufted ears",
            "info": "Skilled hunters and are known for their elusive nature",
            "fact": "Have a wide range of vocalizations",
            "description": "Native North American wildcats known for their adaptability and stealthy hunting."
        },
        {
            "name": "Bobolink",
            "habitat": "Found in grasslands and meadows of North America",
            "data": "Songbirds with striking black-and-white breeding plumage",
            "info": "Migratory birds that travel long distances between breeding and wintering grounds",
            "fact": "Known for their bubbly, metallic song",
            "description": "Migratory songbirds celebrated for their striking appearance and melodious songs."
        },
        {
            "name": "Bonobo",
            "habitat": "Found in tropical rainforests of the Democratic Republic of the Congo",
            "data": "Close relatives of chimpanzees and humans",
            "info": "Known for their peaceful and matriarchal social structure",
            "fact": "Resolve conflicts through sexual behaviors",
            "description": "Great apes known for their unique social dynamics and close genetic relationship to humans."
        },
        {
            "name": "Bovid",
            "habitat": "Found in diverse habitats worldwide, including grasslands and mountains",
            "data": "A family of cloven-hoofed mammals, including cattle, sheep, and goats",
            "info": "Herbivorous animals known for their economic importance to humans",
            "fact": "Have specialized stomachs for digesting plant material",
            "description": "Diverse and economically significant mammals known for their cloven hooves."
        },
        {
            "name": "Buffalo",
            "habitat": "Found in grasslands and savannas of Africa and North America",
            "data": "Large herbivorous mammals with distinctive horns",
            "info": "Social animals that often form large herds",
            "fact": "Cape are considered one of Africa's most dangerous animals",
            "description": "Robust and social mammals known for their iconic horns and herding behavior."
        },
        {
            "name": "Bug",
            "habitat": "Found in various terrestrial and aquatic environments",
            "data": "A colloquial term often used to refer to various insects",
            "info": "Insects belong to the most diverse group of animals on Earth",
            "fact": "Some, like bedbugs and stink, are known pests",
            "description": "The term is informally used to describe various insects from different orders."
        },
        {
            "name": "Butterfly",
            "habitat": "Found in diverse terrestrial environments with flowering plants",
            "data": "Insects known for their vibrant wing patterns and proboscises",
            "info": "Undergo complete metamorphosis during their life cycle",
            "fact": "Monarch are famous for their long-distance migrations",
            "description": "Colorful insects celebrated for their beauty and role in pollination."
        },
        {
            "name": "Buzzard",
            "habitat": "Found in a variety of habitats, including woodlands and open country",
            "data": "Birds of prey known for their soaring flight and sharp talons",
            "info": "Opportunistic hunters, feeding on small mammals and carrion",
            "fact": "Common are often associated with folklore and superstitions",
            "description": "Raptors known for their ability to glide effortlessly in search of prey."
        }
    ]
}